'number' + 3 + 3 // результат: number33, тому що виконується конкатенація

null + 3 // 

5 && "qwerty" // результат: 

+'40' + +'2' + "hillel"; // результат: 

'10' - 5 === 6; // результат: 

true + false // результат: 

'4px' - 3 // результат: 

'4' - 3 // результат: 

'6' + 3 ** 0; // результат: 

12 / '6' // результат: 

'10' + (5 === 6); // результат: 

null == '' // результат: 

3 ** (9 / 3); // результат: 

!!'false' == !!'true' // результат: 

0 || '0' && 1 // результат: 

(+null == false) < 1; // результат: 

false && true || true // результат: 

false && (false || true); // результат: 

(+null == false) < 1 ** 5; // результат: 
